espressif/esp-idf/components/soc/esp32h4/register/soc/tee_reg.h
/** TEE_M29_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M29_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x74)
/** TEE_M29_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures M29 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M29_MODE    0x00000003U
#define TEE_M29_MODE_M  (TEE_M29_MODE_V << TEE_M29_MODE_S)
#define TEE_M29_MODE_V  0x00000003U
#define TEE_M29_MODE_S  0
/** TEE_M29_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m0 tee configuration
 */
#define TEE_M29_LOCK    (BIT(2))
#define TEE_M29_LOCK_M  (TEE_M29_LOCK_V << TEE_M29_LOCK_S)
#define TEE_M29_LOCK_V  0x00000001U
#define TEE_M29_LOCK_S  2

/** TEE_M30_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M30_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x78)
/** TEE_M30_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures M30 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M30_MODE    0x00000003U
#define TEE_M30_MODE_M  (TEE_M30_MODE_V << TEE_M30_MODE_S)
#define TEE_M30_MODE_V  0x00000003U
#define TEE_M30_MODE_S  0
/** TEE_M30_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m0 tee configuration
 */
#define TEE_M30_LOCK    (BIT(2))
#define TEE_M30_LOCK_M  (TEE_M30_LOCK_V << TEE_M30_LOCK_S)
#define TEE_M30_LOCK_V  0x00000001U
#define TEE_M30_LOCK_S  2

/** TEE_M31_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M31_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x7c)
/** TEE_M31_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures M31 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M31_MODE    0x00000003U
#define TEE_M31_MODE_M  (TEE_M31_MODE_V << TEE_M31_MODE_S)
#define TEE_M31_MODE_V  0x00000003U
#define TEE_M31_MODE_S  0
/** TEE_M31_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m0 tee configuration
 */
#define TEE_M31_LOCK    (BIT(2))
#define TEE_M31_LOCK_M  (TEE_M31_LOCK_V << TEE_M31_LOCK_S)
#define TEE_M31_LOCK_V  0x00000001U
#define TEE_M31_LOCK_S  2

/** TEE_GPSPI0_CTRL_REG register
 *  gpspi0 read/write control register
 */
#define TEE_GPSPI0_CTRL_REG (DR_REG_TEE_BASE + 0x80)
/** TEE_READ_TEE_GPSPI0 : R/W; bitpos: [0]; default: 1;
 *  Configures gpspi0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_GPSPI0    (BIT(0))
#define TEE_READ_TEE_GPSPI0_M  (TEE_READ_TEE_GPSPI0_V << TEE_READ_TEE_GPSPI0_S)
#define TEE_READ_TEE_GPSPI0_V  0x00000001U
#define TEE_READ_TEE_GPSPI0_S  0
/** TEE_READ_REE0_GPSPI0 : R/W; bitpos: [1]; default: 0;
 *  Configures gpspi0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_GPSPI0    (BIT(1))
#define TEE_READ_REE0_GPSPI0_M  (TEE_READ_REE0_GPSPI0_V << TEE_READ_REE0_GPSPI0_S)
#define TEE_READ_REE0_GPSPI0_V  0x00000001U
#define TEE_READ_REE0_GPSPI0_S  1
/** TEE_READ_REE1_GPSPI0 : R/W; bitpos: [2]; default: 0;
 *  Configures gpspi0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_GPSPI0    (BIT(2))
#define TEE_READ_REE1_GPSPI0_M  (TEE_READ_REE1_GPSPI0_V << TEE_READ_REE1_GPSPI0_S)
#define TEE_READ_REE1_GPSPI0_V  0x00000001U
#define TEE_READ_REE1_GPSPI0_S  2
/** TEE_READ_REE2_GPSPI0 : R/W; bitpos: [3]; default: 0;
 *  Configures gpspi0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_GPSPI0    (BIT(3))
#define TEE_READ_REE2_GPSPI0_M  (TEE_READ_REE2_GPSPI0_V << TEE_READ_REE2_GPSPI0_S)
#define TEE_READ_REE2_GPSPI0_V  0x00000001U
#define TEE_READ_REE2_GPSPI0_S  3
/** TEE_WRITE_TEE_GPSPI0 : R/W; bitpos: [4]; default: 1;
 *  Configures gpspi0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_GPSPI0    (BIT(4))
#define TEE_WRITE_TEE_GPSPI0_M  (TEE_WRITE_TEE_GPSPI0_V << TEE_WRITE_TEE_GPSPI0_S)
#define TEE_WRITE_TEE_GPSPI0_V  0x00000001U
#define TEE_WRITE_TEE_GPSPI0_S  4
/** TEE_WRITE_REE0_GPSPI0 : R/W; bitpos: [5]; default: 0;
 *  Configures gpspi0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_GPSPI0    (BIT(5))
#define TEE_WRITE_REE0_GPSPI0_M  (TEE_WRITE_REE0_GPSPI0_V << TEE_WRITE_REE0_GPSPI0_S)
#define TEE_WRITE_REE0_GPSPI0_V  0x00000001U
#define TEE_WRITE_REE0_GPSPI0_S  5
/** TEE_WRITE_REE1_GPSPI0 : R/W; bitpos: [6]; default: 0;
 *  Configures gpspi0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_GPSPI0    (BIT(6))
#define TEE_WRITE_REE1_GPSPI0_M  (TEE_WRITE_REE1_GPSPI0_V << TEE_WRITE_REE1_GPSPI0_S)
#define TEE_WRITE_REE1_GPSPI0_V  0x00000001U
#define TEE_WRITE_REE1_GPSPI0_S  6
/** TEE_WRITE_REE2_GPSPI0 : R/W; bitpos: [7]; default: 0;
 *  Configures gpspi0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_GPSPI0    (BIT(7))
#define TEE_WRITE_REE2_GPSPI0_M  (TEE_WRITE_REE2_GPSPI0_V << TEE_WRITE_REE2_GPSPI0_S)
#define TEE_WRITE_REE2_GPSPI0_V  0x00000001U
#define TEE_WRITE_REE2_GPSPI0_S  7

/** TEE_GPSPI1_CTRL_REG register
 *  gpspi1 read/write control register
 */
#define TEE_GPSPI1_CTRL_REG (DR_REG_TEE_BASE + 0x84)
/** TEE_READ_TEE_GPSPI1 : R/W; bitpos: [0]; default: 1;
 *  Configures gpspi1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_GPSPI1    (BIT(0))
#define TEE_READ_TEE_GPSPI1_M  (TEE_READ_TEE_GPSPI1_V << TEE_READ_TEE_GPSPI1_S)
#define TEE_READ_TEE_GPSPI1_V  0x00000001U
#define TEE_READ_TEE_GPSPI1_S  0
/** TEE_READ_REE0_GPSPI1 : R/W; bitpos: [1]; default: 0;
 *  Configures gpspi1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_GPSPI1    (BIT(1))
#define TEE_READ_REE0_GPSPI1_M  (TEE_READ_REE0_GPSPI1_V << TEE_READ_REE0_GPSPI1_S)
#define TEE_READ_REE0_GPSPI1_V  0x00000001U
#define TEE_READ_REE0_GPSPI1_S  1
/** TEE_READ_REE1_GPSPI1 : R/W; bitpos: [2]; default: 0;
 *  Configures gpspi1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_GPSPI1    (BIT(2))
#define TEE_READ_REE1_GPSPI1_M  (TEE_READ_REE1_GPSPI1_V << TEE_READ_REE1_GPSPI1_S)
#define TEE_READ_REE1_GPSPI1_V  0x00000001U
#define TEE_READ_REE1_GPSPI1_S  2
/** TEE_READ_REE2_GPSPI1 : R/W; bitpos: [3]; default: 0;
 *  Configures gpspi1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_GPSPI1    (BIT(3))
#define TEE_READ_REE2_GPSPI1_M  (TEE_READ_REE2_GPSPI1_V << TEE_READ_REE2_GPSPI1_S)
#define TEE_READ_REE2_GPSPI1_V  0x00000001U
#define TEE_READ_REE2_GPSPI1_S  3
/** TEE_WRITE_TEE_GPSPI1 : R/W; bitpos: [4]; default: 1;
 *  Configures gpspi1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_GPSPI1    (BIT(4))
#define TEE_WRITE_TEE_GPSPI1_M  (TEE_WRITE_TEE_GPSPI1_V << TEE_WRITE_TEE_GPSPI1_S)
#define TEE_WRITE_TEE_GPSPI1_V  0x00000001U
#define TEE_WRITE_TEE_GPSPI1_S  4
/** TEE_WRITE_REE0_GPSPI1 : R/W; bitpos: [5]; default: 0;
 *  Configures gpspi1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_GPSPI1    (BIT(5))
#define TEE_WRITE_REE0_GPSPI1_M  (TEE_WRITE_REE0_GPSPI1_V << TEE_WRITE_REE0_GPSPI1_S)
#define TEE_WRITE_REE0_GPSPI1_V  0x00000001U
#define TEE_WRITE_REE0_GPSPI1_S  5
/** TEE_WRITE_REE1_GPSPI1 : R/W; bitpos: [6]; default: 0;
 *  Configures gpspi1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_GPSPI1    (BIT(6))
#define TEE_WRITE_REE1_GPSPI1_M  (TEE_WRITE_REE1_GPSPI1_V << TEE_WRITE_REE1_GPSPI1_S)
#define TEE_WRITE_REE1_GPSPI1_V  0x00000001U
#define TEE_WRITE_REE1_GPSPI1_S  6
/** TEE_WRITE_REE2_GPSPI1 : R/W; bitpos: [7]; default: 0;
 *  Configures gpspi1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_GPSPI1    (BIT(7))
#define TEE_WRITE_REE2_GPSPI1_M  (TEE_WRITE_REE2_GPSPI1_V << TEE_WRITE_REE2_GPSPI1_S)
#define TEE_WRITE_REE2_GPSPI1_V  0x00000001U
#define TEE_WRITE_REE2_GPSPI1_S  7

/** TEE_UART0_CTRL_REG register
 *  uart0 read/write control register
 */
#define TEE_UART0_CTRL_REG (DR_REG_TEE_BASE + 0x88)
/** TEE_READ_TEE_UART0 : R/W; bitpos: [0]; default: 1;
 *  Configures uart0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_UART0    (BIT(0))
#define TEE_READ_TEE_UART0_M  (TEE_READ_TEE_UART0_V << TEE_READ_TEE_UART0_S)
#define TEE_READ_TEE_UART0_V  0x00000001U
#define TEE_READ_TEE_UART0_S  0
/** TEE_READ_REE0_UART0 : R/W; bitpos: [1]; default: 0;
 *  Configures uart0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_UART0    (BIT(1))
#define TEE_READ_REE0_UART0_M  (TEE_READ_REE0_UART0_V << TEE_READ_REE0_UART0_S)
#define TEE_READ_REE0_UART0_V  0x00000001U
#define TEE_READ_REE0_UART0_S  1
/** TEE_READ_REE1_UART0 : R/W; bitpos: [2]; default: 0;
 *  Configures uart0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_UART0    (BIT(2))
#define TEE_READ_REE1_UART0_M  (TEE_READ_REE1_UART0_V << TEE_READ_REE1_UART0_S)
#define TEE_READ_REE1_UART0_V  0x00000001U
#define TEE_READ_REE1_UART0_S  2
/** TEE_READ_REE2_UART0 : R/W; bitpos: [3]; default: 0;
 *  Configures uart0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_UART0    (BIT(3))
#define TEE_READ_REE2_UART0_M  (TEE_READ_REE2_UART0_V << TEE_READ_REE2_UART0_S)
#define TEE_READ_REE2_UART0_V  0x00000001U
#define TEE_READ_REE2_UART0_S  3
/** TEE_WRITE_TEE_UART0 : R/W; bitpos: [4]; default: 1;
 *  Configures uart0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_UART0    (BIT(4))
#define TEE_WRITE_TEE_UART0_M  (TEE_WRITE_TEE_UART0_V << TEE_WRITE_TEE_UART0_S)
#define TEE_WRITE_TEE_UART0_V  0x00000001U
#define TEE_WRITE_TEE_UART0_S  4
/** TEE_WRITE_REE0_UART0 : R/W; bitpos: [5]; default: 0;
 *  Configures uart0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_UART0    (BIT(5))
#define TEE_WRITE_REE0_UART0_M  (TEE_WRITE_REE0_UART0_V << TEE_WRITE_REE0_UART0_S)
#define TEE_WRITE_REE0_UART0_V  0x00000001U
#define TEE_WRITE_REE0_UART0_S  5
/** TEE_WRITE_REE1_UART0 : R/W; bitpos: [6]; default: 0;
 *  Configures uart0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_UART0    (BIT(6))
#define TEE_WRITE_REE1_UART0_M  (TEE_WRITE_REE1_UART0_V << TEE_WRITE_REE1_UART0_S)
#define TEE_WRITE_REE1_UART0_V  0x00000001U
#define TEE_WRITE_REE1_UART0_S  6
/** TEE_WRITE_REE2_UART0 : R/W; bitpos: [7]; default: 0;
 *  Configures uart0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_UART0    (BIT(7))
#define TEE_WRITE_REE2_UART0_M  (TEE_WRITE_REE2_UART0_V << TEE_WRITE_REE2_UART0_S)
#define TEE_WRITE_REE2_UART0_V  0x00000001U
#define TEE_WRITE_REE2_UART0_S  7

/** TEE_UART1_CTRL_REG register
 *  uart1 read/write control register
 */
#define TEE_UART1_CTRL_REG (DR_REG_TEE_BASE + 0x8c)
/** TEE_READ_TEE_UART1 : R/W; bitpos: [0]; default: 1;
 *  Configures uart1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_UART1    (BIT(0))
#define TEE_READ_TEE_UART1_M  (TEE_READ_TEE_UART1_V << TEE_READ_TEE_UART1_S)
#define TEE_READ_TEE_UART1_V  0x00000001U
#define TEE_READ_TEE_UART1_S  0
/** TEE_READ_REE0_UART1 : R/W; bitpos: [1]; default: 0;
 *  Configures uart1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_UART1    (BIT(1))
#define TEE_READ_REE0_UART1_M  (TEE_READ_REE0_UART1_V << TEE_READ_REE0_UART1_S)
#define TEE_READ_REE0_UART1_V  0x00000001U
#define TEE_READ_REE0_UART1_S  1
/** TEE_READ_REE1_UART1 : R/W; bitpos: [2]; default: 0;
 *  Configures uart1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_UART1    (BIT(2))
#define TEE_READ_REE1_UART1_M  (TEE_READ_REE1_UART1_V << TEE_READ_REE1_UART1_S)
#define TEE_READ_REE1_UART1_V  0x00000001U
#define TEE_READ_REE1_UART1_S  2
/** TEE_READ_REE2_UART1 : R/W; bitpos: [3]; default: 0;
 *  Configures uart1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_UART1    (BIT(3))
#define TEE_READ_REE2_UART1_M  (TEE_READ_REE2_UART1_V << TEE_READ_REE2_UART1_S)
#define TEE_READ_REE2_UART1_V  0x00000001U
#define TEE_READ_REE2_UART1_S  3
/** TEE_WRITE_TEE_UART1 : R/W; bitpos: [4]; default: 1;
 *  Configures uart1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_UART1    (BIT(4))
#define TEE_WRITE_TEE_UART1_M  (TEE_WRITE_TEE_UART1_V << TEE_WRITE_TEE_UART1_S)
#define TEE_WRITE_TEE_UART1_V  0x00000001U
#define TEE_WRITE_TEE_UART1_S  4
/** TEE_WRITE_REE0_UART1 : R/W; bitpos: [5]; default: 0;
 *  Configures uart1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_UART1    (BIT(5))
#define TEE_WRITE_REE0_UART1_M  (TEE_WRITE_REE0_UART1_V << TEE_WRITE_REE0_UART1_S)
#define TEE_WRITE_REE0_UART1_V  0x00000001U
#define TEE_WRITE_REE0_UART1_S  5
/** TEE_WRITE_REE1_UART1 : R/W; bitpos: [6]; default: 0;
 *  Configures uart1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_UART1    (BIT(6))
#define TEE_WRITE_REE1_UART1_M  (TEE_WRITE_REE1_UART1_V << TEE_WRITE_REE1_UART1_S)
#define TEE_WRITE_REE1_UART1_V  0x00000001U
#define TEE_WRITE_REE1_UART1_S  6
/** TEE_WRITE_REE2_UART1 : R/W; bitpos: [7]; default: 0;
 *  Configures uart1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_UART1    (BIT(7))
#define TEE_WRITE_REE2_UART1_M  (TEE_WRITE_REE2_UART1_V << TEE_WRITE_REE2_UART1_S)
#define TEE_WRITE_REE2_UART1_V  0x00000001U
#define TEE_WRITE_REE2_UART1_S  7

