espressif/esp-idf/components/soc/esp32h4/register/soc/tee_reg.h
/** TEE_UHCI_CTRL_REG register
 *  uhci read/write control register
 */
#define TEE_UHCI_CTRL_REG (DR_REG_TEE_BASE + 0x90)
/** TEE_READ_TEE_UHCI : R/W; bitpos: [0]; default: 1;
 *  Configures uhci registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_UHCI    (BIT(0))
#define TEE_READ_TEE_UHCI_M  (TEE_READ_TEE_UHCI_V << TEE_READ_TEE_UHCI_S)
#define TEE_READ_TEE_UHCI_V  0x00000001U
#define TEE_READ_TEE_UHCI_S  0
/** TEE_READ_REE0_UHCI : R/W; bitpos: [1]; default: 0;
 *  Configures uhci registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_UHCI    (BIT(1))
#define TEE_READ_REE0_UHCI_M  (TEE_READ_REE0_UHCI_V << TEE_READ_REE0_UHCI_S)
#define TEE_READ_REE0_UHCI_V  0x00000001U
#define TEE_READ_REE0_UHCI_S  1
/** TEE_READ_REE1_UHCI : R/W; bitpos: [2]; default: 0;
 *  Configures uhci registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_UHCI    (BIT(2))
#define TEE_READ_REE1_UHCI_M  (TEE_READ_REE1_UHCI_V << TEE_READ_REE1_UHCI_S)
#define TEE_READ_REE1_UHCI_V  0x00000001U
#define TEE_READ_REE1_UHCI_S  2
/** TEE_READ_REE2_UHCI : R/W; bitpos: [3]; default: 0;
 *  Configures uhci registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_UHCI    (BIT(3))
#define TEE_READ_REE2_UHCI_M  (TEE_READ_REE2_UHCI_V << TEE_READ_REE2_UHCI_S)
#define TEE_READ_REE2_UHCI_V  0x00000001U
#define TEE_READ_REE2_UHCI_S  3
/** TEE_WRITE_TEE_UHCI : R/W; bitpos: [4]; default: 1;
 *  Configures uhci registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_UHCI    (BIT(4))
#define TEE_WRITE_TEE_UHCI_M  (TEE_WRITE_TEE_UHCI_V << TEE_WRITE_TEE_UHCI_S)
#define TEE_WRITE_TEE_UHCI_V  0x00000001U
#define TEE_WRITE_TEE_UHCI_S  4
/** TEE_WRITE_REE0_UHCI : R/W; bitpos: [5]; default: 0;
 *  Configures uhci registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_UHCI    (BIT(5))
#define TEE_WRITE_REE0_UHCI_M  (TEE_WRITE_REE0_UHCI_V << TEE_WRITE_REE0_UHCI_S)
#define TEE_WRITE_REE0_UHCI_V  0x00000001U
#define TEE_WRITE_REE0_UHCI_S  5
/** TEE_WRITE_REE1_UHCI : R/W; bitpos: [6]; default: 0;
 *  Configures uhci registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_UHCI    (BIT(6))
#define TEE_WRITE_REE1_UHCI_M  (TEE_WRITE_REE1_UHCI_V << TEE_WRITE_REE1_UHCI_S)
#define TEE_WRITE_REE1_UHCI_V  0x00000001U
#define TEE_WRITE_REE1_UHCI_S  6
/** TEE_WRITE_REE2_UHCI : R/W; bitpos: [7]; default: 0;
 *  Configures uhci registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_UHCI    (BIT(7))
#define TEE_WRITE_REE2_UHCI_M  (TEE_WRITE_REE2_UHCI_V << TEE_WRITE_REE2_UHCI_S)
#define TEE_WRITE_REE2_UHCI_V  0x00000001U
#define TEE_WRITE_REE2_UHCI_S  7

/** TEE_I2C0_CTRL_REG register
 *  i2c0 read/write control register
 */
#define TEE_I2C0_CTRL_REG (DR_REG_TEE_BASE + 0x94)
/** TEE_READ_TEE_I2C0 : R/W; bitpos: [0]; default: 1;
 *  Configures i2c0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_I2C0    (BIT(0))
#define TEE_READ_TEE_I2C0_M  (TEE_READ_TEE_I2C0_V << TEE_READ_TEE_I2C0_S)
#define TEE_READ_TEE_I2C0_V  0x00000001U
#define TEE_READ_TEE_I2C0_S  0
/** TEE_READ_REE0_I2C0 : R/W; bitpos: [1]; default: 0;
 *  Configures i2c0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_I2C0    (BIT(1))
#define TEE_READ_REE0_I2C0_M  (TEE_READ_REE0_I2C0_V << TEE_READ_REE0_I2C0_S)
#define TEE_READ_REE0_I2C0_V  0x00000001U
#define TEE_READ_REE0_I2C0_S  1
/** TEE_READ_REE1_I2C0 : R/W; bitpos: [2]; default: 0;
 *  Configures i2c0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_I2C0    (BIT(2))
#define TEE_READ_REE1_I2C0_M  (TEE_READ_REE1_I2C0_V << TEE_READ_REE1_I2C0_S)
#define TEE_READ_REE1_I2C0_V  0x00000001U
#define TEE_READ_REE1_I2C0_S  2
/** TEE_READ_REE2_I2C0 : R/W; bitpos: [3]; default: 0;
 *  Configures i2c0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_I2C0    (BIT(3))
#define TEE_READ_REE2_I2C0_M  (TEE_READ_REE2_I2C0_V << TEE_READ_REE2_I2C0_S)
#define TEE_READ_REE2_I2C0_V  0x00000001U
#define TEE_READ_REE2_I2C0_S  3
/** TEE_WRITE_TEE_I2C0 : R/W; bitpos: [4]; default: 1;
 *  Configures i2c0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_I2C0    (BIT(4))
#define TEE_WRITE_TEE_I2C0_M  (TEE_WRITE_TEE_I2C0_V << TEE_WRITE_TEE_I2C0_S)
#define TEE_WRITE_TEE_I2C0_V  0x00000001U
#define TEE_WRITE_TEE_I2C0_S  4
/** TEE_WRITE_REE0_I2C0 : R/W; bitpos: [5]; default: 0;
 *  Configures i2c0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_I2C0    (BIT(5))
#define TEE_WRITE_REE0_I2C0_M  (TEE_WRITE_REE0_I2C0_V << TEE_WRITE_REE0_I2C0_S)
#define TEE_WRITE_REE0_I2C0_V  0x00000001U
#define TEE_WRITE_REE0_I2C0_S  5
/** TEE_WRITE_REE1_I2C0 : R/W; bitpos: [6]; default: 0;
 *  Configures i2c0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_I2C0    (BIT(6))
#define TEE_WRITE_REE1_I2C0_M  (TEE_WRITE_REE1_I2C0_V << TEE_WRITE_REE1_I2C0_S)
#define TEE_WRITE_REE1_I2C0_V  0x00000001U
#define TEE_WRITE_REE1_I2C0_S  6
/** TEE_WRITE_REE2_I2C0 : R/W; bitpos: [7]; default: 0;
 *  Configures i2c0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_I2C0    (BIT(7))
#define TEE_WRITE_REE2_I2C0_M  (TEE_WRITE_REE2_I2C0_V << TEE_WRITE_REE2_I2C0_S)
#define TEE_WRITE_REE2_I2C0_V  0x00000001U
#define TEE_WRITE_REE2_I2C0_S  7

/** TEE_I2C1_CTRL_REG register
 *  i2c1 read/write control register
 */
#define TEE_I2C1_CTRL_REG (DR_REG_TEE_BASE + 0x98)
/** TEE_READ_TEE_I2C1 : R/W; bitpos: [0]; default: 1;
 *  Configures i2c1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_I2C1    (BIT(0))
#define TEE_READ_TEE_I2C1_M  (TEE_READ_TEE_I2C1_V << TEE_READ_TEE_I2C1_S)
#define TEE_READ_TEE_I2C1_V  0x00000001U
#define TEE_READ_TEE_I2C1_S  0
/** TEE_READ_REE0_I2C1 : R/W; bitpos: [1]; default: 0;
 *  Configures i2c1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_I2C1    (BIT(1))
#define TEE_READ_REE0_I2C1_M  (TEE_READ_REE0_I2C1_V << TEE_READ_REE0_I2C1_S)
#define TEE_READ_REE0_I2C1_V  0x00000001U
#define TEE_READ_REE0_I2C1_S  1
/** TEE_READ_REE1_I2C1 : R/W; bitpos: [2]; default: 0;
 *  Configures i2c1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_I2C1    (BIT(2))
#define TEE_READ_REE1_I2C1_M  (TEE_READ_REE1_I2C1_V << TEE_READ_REE1_I2C1_S)
#define TEE_READ_REE1_I2C1_V  0x00000001U
#define TEE_READ_REE1_I2C1_S  2
/** TEE_READ_REE2_I2C1 : R/W; bitpos: [3]; default: 0;
 *  Configures i2c1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_I2C1    (BIT(3))
#define TEE_READ_REE2_I2C1_M  (TEE_READ_REE2_I2C1_V << TEE_READ_REE2_I2C1_S)
#define TEE_READ_REE2_I2C1_V  0x00000001U
#define TEE_READ_REE2_I2C1_S  3
/** TEE_WRITE_TEE_I2C1 : R/W; bitpos: [4]; default: 1;
 *  Configures i2c1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_I2C1    (BIT(4))
#define TEE_WRITE_TEE_I2C1_M  (TEE_WRITE_TEE_I2C1_V << TEE_WRITE_TEE_I2C1_S)
#define TEE_WRITE_TEE_I2C1_V  0x00000001U
#define TEE_WRITE_TEE_I2C1_S  4
/** TEE_WRITE_REE0_I2C1 : R/W; bitpos: [5]; default: 0;
 *  Configures i2c1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_I2C1    (BIT(5))
#define TEE_WRITE_REE0_I2C1_M  (TEE_WRITE_REE0_I2C1_V << TEE_WRITE_REE0_I2C1_S)
#define TEE_WRITE_REE0_I2C1_V  0x00000001U
#define TEE_WRITE_REE0_I2C1_S  5
/** TEE_WRITE_REE1_I2C1 : R/W; bitpos: [6]; default: 0;
 *  Configures i2c1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_I2C1    (BIT(6))
#define TEE_WRITE_REE1_I2C1_M  (TEE_WRITE_REE1_I2C1_V << TEE_WRITE_REE1_I2C1_S)
#define TEE_WRITE_REE1_I2C1_V  0x00000001U
#define TEE_WRITE_REE1_I2C1_S  6
/** TEE_WRITE_REE2_I2C1 : R/W; bitpos: [7]; default: 0;
 *  Configures i2c1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_I2C1    (BIT(7))
#define TEE_WRITE_REE2_I2C1_M  (TEE_WRITE_REE2_I2C1_V << TEE_WRITE_REE2_I2C1_S)
#define TEE_WRITE_REE2_I2C1_V  0x00000001U
#define TEE_WRITE_REE2_I2C1_S  7

/** TEE_I2S_CTRL_REG register
 *  i2s read/write control register
 */
#define TEE_I2S_CTRL_REG (DR_REG_TEE_BASE + 0x9c)
/** TEE_READ_TEE_I2S : R/W; bitpos: [0]; default: 1;
 *  Configures i2s registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_I2S    (BIT(0))
#define TEE_READ_TEE_I2S_M  (TEE_READ_TEE_I2S_V << TEE_READ_TEE_I2S_S)
#define TEE_READ_TEE_I2S_V  0x00000001U
#define TEE_READ_TEE_I2S_S  0
/** TEE_READ_REE0_I2S : R/W; bitpos: [1]; default: 0;
 *  Configures i2s registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_I2S    (BIT(1))
#define TEE_READ_REE0_I2S_M  (TEE_READ_REE0_I2S_V << TEE_READ_REE0_I2S_S)
#define TEE_READ_REE0_I2S_V  0x00000001U
#define TEE_READ_REE0_I2S_S  1
/** TEE_READ_REE1_I2S : R/W; bitpos: [2]; default: 0;
 *  Configures i2s registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_I2S    (BIT(2))
#define TEE_READ_REE1_I2S_M  (TEE_READ_REE1_I2S_V << TEE_READ_REE1_I2S_S)
#define TEE_READ_REE1_I2S_V  0x00000001U
#define TEE_READ_REE1_I2S_S  2
/** TEE_READ_REE2_I2S : R/W; bitpos: [3]; default: 0;
 *  Configures i2s registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_I2S    (BIT(3))
#define TEE_READ_REE2_I2S_M  (TEE_READ_REE2_I2S_V << TEE_READ_REE2_I2S_S)
#define TEE_READ_REE2_I2S_V  0x00000001U
#define TEE_READ_REE2_I2S_S  3
/** TEE_WRITE_TEE_I2S : R/W; bitpos: [4]; default: 1;
 *  Configures i2s registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_I2S    (BIT(4))
#define TEE_WRITE_TEE_I2S_M  (TEE_WRITE_TEE_I2S_V << TEE_WRITE_TEE_I2S_S)
#define TEE_WRITE_TEE_I2S_V  0x00000001U
#define TEE_WRITE_TEE_I2S_S  4
/** TEE_WRITE_REE0_I2S : R/W; bitpos: [5]; default: 0;
 *  Configures i2s registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_I2S    (BIT(5))
#define TEE_WRITE_REE0_I2S_M  (TEE_WRITE_REE0_I2S_V << TEE_WRITE_REE0_I2S_S)
#define TEE_WRITE_REE0_I2S_V  0x00000001U
#define TEE_WRITE_REE0_I2S_S  5
/** TEE_WRITE_REE1_I2S : R/W; bitpos: [6]; default: 0;
 *  Configures i2s registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_I2S    (BIT(6))
#define TEE_WRITE_REE1_I2S_M  (TEE_WRITE_REE1_I2S_V << TEE_WRITE_REE1_I2S_S)
#define TEE_WRITE_REE1_I2S_V  0x00000001U
#define TEE_WRITE_REE1_I2S_S  6
/** TEE_WRITE_REE2_I2S : R/W; bitpos: [7]; default: 0;
 *  Configures i2s registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_I2S    (BIT(7))
#define TEE_WRITE_REE2_I2S_M  (TEE_WRITE_REE2_I2S_V << TEE_WRITE_REE2_I2S_S)
#define TEE_WRITE_REE2_I2S_V  0x00000001U
#define TEE_WRITE_REE2_I2S_S  7

/** TEE_PARL_IO_CTRL_REG register
 *  parl_io read/write control register
 */
#define TEE_PARL_IO_CTRL_REG (DR_REG_TEE_BASE + 0xa0)
/** TEE_READ_TEE_PARL_IO : R/W; bitpos: [0]; default: 1;
 *  Configures parl_io registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_PARL_IO    (BIT(0))
#define TEE_READ_TEE_PARL_IO_M  (TEE_READ_TEE_PARL_IO_V << TEE_READ_TEE_PARL_IO_S)
#define TEE_READ_TEE_PARL_IO_V  0x00000001U
#define TEE_READ_TEE_PARL_IO_S  0
/** TEE_READ_REE0_PARL_IO : R/W; bitpos: [1]; default: 0;
 *  Configures parl_io registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_PARL_IO    (BIT(1))
#define TEE_READ_REE0_PARL_IO_M  (TEE_READ_REE0_PARL_IO_V << TEE_READ_REE0_PARL_IO_S)
#define TEE_READ_REE0_PARL_IO_V  0x00000001U
#define TEE_READ_REE0_PARL_IO_S  1
/** TEE_READ_REE1_PARL_IO : R/W; bitpos: [2]; default: 0;
 *  Configures parl_io registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_PARL_IO    (BIT(2))
#define TEE_READ_REE1_PARL_IO_M  (TEE_READ_REE1_PARL_IO_V << TEE_READ_REE1_PARL_IO_S)
#define TEE_READ_REE1_PARL_IO_V  0x00000001U
#define TEE_READ_REE1_PARL_IO_S  2
/** TEE_READ_REE2_PARL_IO : R/W; bitpos: [3]; default: 0;
 *  Configures parl_io registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_PARL_IO    (BIT(3))
#define TEE_READ_REE2_PARL_IO_M  (TEE_READ_REE2_PARL_IO_V << TEE_READ_REE2_PARL_IO_S)
#define TEE_READ_REE2_PARL_IO_V  0x00000001U
#define TEE_READ_REE2_PARL_IO_S  3
/** TEE_WRITE_TEE_PARL_IO : R/W; bitpos: [4]; default: 1;
 *  Configures parl_io registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_PARL_IO    (BIT(4))
#define TEE_WRITE_TEE_PARL_IO_M  (TEE_WRITE_TEE_PARL_IO_V << TEE_WRITE_TEE_PARL_IO_S)
#define TEE_WRITE_TEE_PARL_IO_V  0x00000001U
#define TEE_WRITE_TEE_PARL_IO_S  4
/** TEE_WRITE_REE0_PARL_IO : R/W; bitpos: [5]; default: 0;
 *  Configures parl_io registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_PARL_IO    (BIT(5))
#define TEE_WRITE_REE0_PARL_IO_M  (TEE_WRITE_REE0_PARL_IO_V << TEE_WRITE_REE0_PARL_IO_S)
#define TEE_WRITE_REE0_PARL_IO_V  0x00000001U
#define TEE_WRITE_REE0_PARL_IO_S  5
/** TEE_WRITE_REE1_PARL_IO : R/W; bitpos: [6]; default: 0;
 *  Configures parl_io registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_PARL_IO    (BIT(6))
#define TEE_WRITE_REE1_PARL_IO_M  (TEE_WRITE_REE1_PARL_IO_V << TEE_WRITE_REE1_PARL_IO_S)
#define TEE_WRITE_REE1_PARL_IO_V  0x00000001U
#define TEE_WRITE_REE1_PARL_IO_S  6
/** TEE_WRITE_REE2_PARL_IO : R/W; bitpos: [7]; default: 0;
 *  Configures parl_io registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_PARL_IO    (BIT(7))
#define TEE_WRITE_REE2_PARL_IO_M  (TEE_WRITE_REE2_PARL_IO_V << TEE_WRITE_REE2_PARL_IO_S)
#define TEE_WRITE_REE2_PARL_IO_V  0x00000001U
#define TEE_WRITE_REE2_PARL_IO_S  7

/** TEE_PWM0_CTRL_REG register
 *  pwm0 read/write control register
 */
#define TEE_PWM0_CTRL_REG (DR_REG_TEE_BASE + 0xa4)
/** TEE_READ_TEE_PWM0 : R/W; bitpos: [0]; default: 1;
 *  Configures pwm0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_PWM0    (BIT(0))
#define TEE_READ_TEE_PWM0_M  (TEE_READ_TEE_PWM0_V << TEE_READ_TEE_PWM0_S)
#define TEE_READ_TEE_PWM0_V  0x00000001U
#define TEE_READ_TEE_PWM0_S  0
/** TEE_READ_REE0_PWM0 : R/W; bitpos: [1]; default: 0;
 *  Configures pwm0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_PWM0    (BIT(1))
#define TEE_READ_REE0_PWM0_M  (TEE_READ_REE0_PWM0_V << TEE_READ_REE0_PWM0_S)
#define TEE_READ_REE0_PWM0_V  0x00000001U
#define TEE_READ_REE0_PWM0_S  1
/** TEE_READ_REE1_PWM0 : R/W; bitpos: [2]; default: 0;
 *  Configures pwm0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_PWM0    (BIT(2))
#define TEE_READ_REE1_PWM0_M  (TEE_READ_REE1_PWM0_V << TEE_READ_REE1_PWM0_S)
#define TEE_READ_REE1_PWM0_V  0x00000001U
#define TEE_READ_REE1_PWM0_S  2
/** TEE_READ_REE2_PWM0 : R/W; bitpos: [3]; default: 0;
 *  Configures pwm0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_PWM0    (BIT(3))
#define TEE_READ_REE2_PWM0_M  (TEE_READ_REE2_PWM0_V << TEE_READ_REE2_PWM0_S)
#define TEE_READ_REE2_PWM0_V  0x00000001U
#define TEE_READ_REE2_PWM0_S  3
/** TEE_WRITE_TEE_PWM0 : R/W; bitpos: [4]; default: 1;
 *  Configures pwm0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_PWM0    (BIT(4))
#define TEE_WRITE_TEE_PWM0_M  (TEE_WRITE_TEE_PWM0_V << TEE_WRITE_TEE_PWM0_S)
#define TEE_WRITE_TEE_PWM0_V  0x00000001U
#define TEE_WRITE_TEE_PWM0_S  4
/** TEE_WRITE_REE0_PWM0 : R/W; bitpos: [5]; default: 0;
 *  Configures pwm0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_PWM0    (BIT(5))
#define TEE_WRITE_REE0_PWM0_M  (TEE_WRITE_REE0_PWM0_V << TEE_WRITE_REE0_PWM0_S)
#define TEE_WRITE_REE0_PWM0_V  0x00000001U
#define TEE_WRITE_REE0_PWM0_S  5
/** TEE_WRITE_REE1_PWM0 : R/W; bitpos: [6]; default: 0;
 *  Configures pwm0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_PWM0    (BIT(6))
#define TEE_WRITE_REE1_PWM0_M  (TEE_WRITE_REE1_PWM0_V << TEE_WRITE_REE1_PWM0_S)
#define TEE_WRITE_REE1_PWM0_V  0x00000001U
#define TEE_WRITE_REE1_PWM0_S  6
/** TEE_WRITE_REE2_PWM0 : R/W; bitpos: [7]; default: 0;
 *  Configures pwm0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_PWM0    (BIT(7))
#define TEE_WRITE_REE2_PWM0_M  (TEE_WRITE_REE2_PWM0_V << TEE_WRITE_REE2_PWM0_S)
#define TEE_WRITE_REE2_PWM0_V  0x00000001U
#define TEE_WRITE_REE2_PWM0_S  7

/** TEE_PWM1_CTRL_REG register
 *  pwm1 read/write control register
 */
#define TEE_PWM1_CTRL_REG (DR_REG_TEE_BASE + 0xa8)
/** TEE_READ_TEE_PWM1 : R/W; bitpos: [0]; default: 1;
 *  Configures pwm1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_PWM1    (BIT(0))
#define TEE_READ_TEE_PWM1_M  (TEE_READ_TEE_PWM1_V << TEE_READ_TEE_PWM1_S)
#define TEE_READ_TEE_PWM1_V  0x00000001U
#define TEE_READ_TEE_PWM1_S  0
/** TEE_READ_REE0_PWM1 : R/W; bitpos: [1]; default: 0;
 *  Configures pwm1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_PWM1    (BIT(1))
#define TEE_READ_REE0_PWM1_M  (TEE_READ_REE0_PWM1_V << TEE_READ_REE0_PWM1_S)
#define TEE_READ_REE0_PWM1_V  0x00000001U
#define TEE_READ_REE0_PWM1_S  1
/** TEE_READ_REE1_PWM1 : R/W; bitpos: [2]; default: 0;
 *  Configures pwm1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_PWM1    (BIT(2))
#define TEE_READ_REE1_PWM1_M  (TEE_READ_REE1_PWM1_V << TEE_READ_REE1_PWM1_S)
#define TEE_READ_REE1_PWM1_V  0x00000001U
#define TEE_READ_REE1_PWM1_S  2
/** TEE_READ_REE2_PWM1 : R/W; bitpos: [3]; default: 0;
 *  Configures pwm1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_PWM1    (BIT(3))
#define TEE_READ_REE2_PWM1_M  (TEE_READ_REE2_PWM1_V << TEE_READ_REE2_PWM1_S)
#define TEE_READ_REE2_PWM1_V  0x00000001U
#define TEE_READ_REE2_PWM1_S  3
/** TEE_WRITE_TEE_PWM1 : R/W; bitpos: [4]; default: 1;
 *  Configures pwm1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_PWM1    (BIT(4))
#define TEE_WRITE_TEE_PWM1_M  (TEE_WRITE_TEE_PWM1_V << TEE_WRITE_TEE_PWM1_S)
#define TEE_WRITE_TEE_PWM1_V  0x00000001U
#define TEE_WRITE_TEE_PWM1_S  4
/** TEE_WRITE_REE0_PWM1 : R/W; bitpos: [5]; default: 0;
 *  Configures pwm1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_PWM1    (BIT(5))
#define TEE_WRITE_REE0_PWM1_M  (TEE_WRITE_REE0_PWM1_V << TEE_WRITE_REE0_PWM1_S)
#define TEE_WRITE_REE0_PWM1_V  0x00000001U
#define TEE_WRITE_REE0_PWM1_S  5
/** TEE_WRITE_REE1_PWM1 : R/W; bitpos: [6]; default: 0;
 *  Configures pwm1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_PWM1    (BIT(6))
#define TEE_WRITE_REE1_PWM1_M  (TEE_WRITE_REE1_PWM1_V << TEE_WRITE_REE1_PWM1_S)
#define TEE_WRITE_REE1_PWM1_V  0x00000001U
#define TEE_WRITE_REE1_PWM1_S  6
/** TEE_WRITE_REE2_PWM1 : R/W; bitpos: [7]; default: 0;
 *  Configures pwm1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_PWM1    (BIT(7))
#define TEE_WRITE_REE2_PWM1_M  (TEE_WRITE_REE2_PWM1_V << TEE_WRITE_REE2_PWM1_S)
#define TEE_WRITE_REE2_PWM1_V  0x00000001U
#define TEE_WRITE_REE2_PWM1_S  7

/** TEE_LEDC_CTRL_REG register
 *  ledc read/write control register
 */
#define TEE_LEDC_CTRL_REG (DR_REG_TEE_BASE + 0xac)
/** TEE_READ_TEE_LEDC : R/W; bitpos: [0]; default: 1;
 *  Configures ledc registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_LEDC    (BIT(0))
#define TEE_READ_TEE_LEDC_M  (TEE_READ_TEE_LEDC_V << TEE_READ_TEE_LEDC_S)
#define TEE_READ_TEE_LEDC_V  0x00000001U
#define TEE_READ_TEE_LEDC_S  0
/** TEE_READ_REE0_LEDC : R/W; bitpos: [1]; default: 0;
 *  Configures ledc registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_LEDC    (BIT(1))
#define TEE_READ_REE0_LEDC_M  (TEE_READ_REE0_LEDC_V << TEE_READ_REE0_LEDC_S)
#define TEE_READ_REE0_LEDC_V  0x00000001U
#define TEE_READ_REE0_LEDC_S  1
/** TEE_READ_REE1_LEDC : R/W; bitpos: [2]; default: 0;
 *  Configures ledc registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_LEDC    (BIT(2))
#define TEE_READ_REE1_LEDC_M  (TEE_READ_REE1_LEDC_V << TEE_READ_REE1_LEDC_S)
#define TEE_READ_REE1_LEDC_V  0x00000001U
#define TEE_READ_REE1_LEDC_S  2
/** TEE_READ_REE2_LEDC : R/W; bitpos: [3]; default: 0;
 *  Configures ledc registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_LEDC    (BIT(3))
#define TEE_READ_REE2_LEDC_M  (TEE_READ_REE2_LEDC_V << TEE_READ_REE2_LEDC_S)
#define TEE_READ_REE2_LEDC_V  0x00000001U
#define TEE_READ_REE2_LEDC_S  3
/** TEE_WRITE_TEE_LEDC : R/W; bitpos: [4]; default: 1;
 *  Configures ledc registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_LEDC    (BIT(4))
#define TEE_WRITE_TEE_LEDC_M  (TEE_WRITE_TEE_LEDC_V << TEE_WRITE_TEE_LEDC_S)
#define TEE_WRITE_TEE_LEDC_V  0x00000001U
#define TEE_WRITE_TEE_LEDC_S  4
/** TEE_WRITE_REE0_LEDC : R/W; bitpos: [5]; default: 0;
 *  Configures ledc registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_LEDC    (BIT(5))
#define TEE_WRITE_REE0_LEDC_M  (TEE_WRITE_REE0_LEDC_V << TEE_WRITE_REE0_LEDC_S)
#define TEE_WRITE_REE0_LEDC_V  0x00000001U
#define TEE_WRITE_REE0_LEDC_S  5
/** TEE_WRITE_REE1_LEDC : R/W; bitpos: [6]; default: 0;
 *  Configures ledc registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_LEDC    (BIT(6))
#define TEE_WRITE_REE1_LEDC_M  (TEE_WRITE_REE1_LEDC_V << TEE_WRITE_REE1_LEDC_S)
#define TEE_WRITE_REE1_LEDC_V  0x00000001U
#define TEE_WRITE_REE1_LEDC_S  6
/** TEE_WRITE_REE2_LEDC : R/W; bitpos: [7]; default: 0;
 *  Configures ledc registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_LEDC    (BIT(7))
#define TEE_WRITE_REE2_LEDC_M  (TEE_WRITE_REE2_LEDC_V << TEE_WRITE_REE2_LEDC_S)
#define TEE_WRITE_REE2_LEDC_V  0x00000001U
#define TEE_WRITE_REE2_LEDC_S  7

