espressif/esp-idf/components/soc/esp32h4/register/soc/tee_reg.h
/** TEE_USB_OTG_FS_CORE_CTRL_REG register
 *  usb_otg_fs_core read/write control register
 */
#define TEE_USB_OTG_FS_CORE_CTRL_REG (DR_REG_TEE_BASE + 0xe8)
/** TEE_READ_TEE_USB_OTG_FS_CORE : R/W; bitpos: [0]; default: 1;
 *  Configures usb_otg_fs_core registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_USB_OTG_FS_CORE    (BIT(0))
#define TEE_READ_TEE_USB_OTG_FS_CORE_M  (TEE_READ_TEE_USB_OTG_FS_CORE_V << TEE_READ_TEE_USB_OTG_FS_CORE_S)
#define TEE_READ_TEE_USB_OTG_FS_CORE_V  0x00000001U
#define TEE_READ_TEE_USB_OTG_FS_CORE_S  0
/** TEE_READ_REE0_USB_OTG_FS_CORE : R/W; bitpos: [1]; default: 0;
 *  Configures usb_otg_fs_core registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_USB_OTG_FS_CORE    (BIT(1))
#define TEE_READ_REE0_USB_OTG_FS_CORE_M  (TEE_READ_REE0_USB_OTG_FS_CORE_V << TEE_READ_REE0_USB_OTG_FS_CORE_S)
#define TEE_READ_REE0_USB_OTG_FS_CORE_V  0x00000001U
#define TEE_READ_REE0_USB_OTG_FS_CORE_S  1
/** TEE_READ_REE1_USB_OTG_FS_CORE : R/W; bitpos: [2]; default: 0;
 *  Configures usb_otg_fs_core registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_USB_OTG_FS_CORE    (BIT(2))
#define TEE_READ_REE1_USB_OTG_FS_CORE_M  (TEE_READ_REE1_USB_OTG_FS_CORE_V << TEE_READ_REE1_USB_OTG_FS_CORE_S)
#define TEE_READ_REE1_USB_OTG_FS_CORE_V  0x00000001U
#define TEE_READ_REE1_USB_OTG_FS_CORE_S  2
/** TEE_READ_REE2_USB_OTG_FS_CORE : R/W; bitpos: [3]; default: 0;
 *  Configures usb_otg_fs_core registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_USB_OTG_FS_CORE    (BIT(3))
#define TEE_READ_REE2_USB_OTG_FS_CORE_M  (TEE_READ_REE2_USB_OTG_FS_CORE_V << TEE_READ_REE2_USB_OTG_FS_CORE_S)
#define TEE_READ_REE2_USB_OTG_FS_CORE_V  0x00000001U
#define TEE_READ_REE2_USB_OTG_FS_CORE_S  3
/** TEE_WRITE_TEE_USB_OTG_FS_CORE : R/W; bitpos: [4]; default: 1;
 *  Configures usb_otg_fs_core registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_USB_OTG_FS_CORE    (BIT(4))
#define TEE_WRITE_TEE_USB_OTG_FS_CORE_M  (TEE_WRITE_TEE_USB_OTG_FS_CORE_V << TEE_WRITE_TEE_USB_OTG_FS_CORE_S)
#define TEE_WRITE_TEE_USB_OTG_FS_CORE_V  0x00000001U
#define TEE_WRITE_TEE_USB_OTG_FS_CORE_S  4
/** TEE_WRITE_REE0_USB_OTG_FS_CORE : R/W; bitpos: [5]; default: 0;
 *  Configures usb_otg_fs_core registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_USB_OTG_FS_CORE    (BIT(5))
#define TEE_WRITE_REE0_USB_OTG_FS_CORE_M  (TEE_WRITE_REE0_USB_OTG_FS_CORE_V << TEE_WRITE_REE0_USB_OTG_FS_CORE_S)
#define TEE_WRITE_REE0_USB_OTG_FS_CORE_V  0x00000001U
#define TEE_WRITE_REE0_USB_OTG_FS_CORE_S  5
/** TEE_WRITE_REE1_USB_OTG_FS_CORE : R/W; bitpos: [6]; default: 0;
 *  Configures usb_otg_fs_core registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_USB_OTG_FS_CORE    (BIT(6))
#define TEE_WRITE_REE1_USB_OTG_FS_CORE_M  (TEE_WRITE_REE1_USB_OTG_FS_CORE_V << TEE_WRITE_REE1_USB_OTG_FS_CORE_S)
#define TEE_WRITE_REE1_USB_OTG_FS_CORE_V  0x00000001U
#define TEE_WRITE_REE1_USB_OTG_FS_CORE_S  6
/** TEE_WRITE_REE2_USB_OTG_FS_CORE : R/W; bitpos: [7]; default: 0;
 *  Configures usb_otg_fs_core registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_USB_OTG_FS_CORE    (BIT(7))
#define TEE_WRITE_REE2_USB_OTG_FS_CORE_M  (TEE_WRITE_REE2_USB_OTG_FS_CORE_V << TEE_WRITE_REE2_USB_OTG_FS_CORE_S)
#define TEE_WRITE_REE2_USB_OTG_FS_CORE_V  0x00000001U
#define TEE_WRITE_REE2_USB_OTG_FS_CORE_S  7

/** TEE_USB_OTG_FS_PHY_CTRL_REG register
 *  usb_otg_fs_phy read/write control register
 */
#define TEE_USB_OTG_FS_PHY_CTRL_REG (DR_REG_TEE_BASE + 0xec)
/** TEE_READ_TEE_USB_OTG_FS_PHY : R/W; bitpos: [0]; default: 1;
 *  Configures usb_otg_fs_phy registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_USB_OTG_FS_PHY    (BIT(0))
#define TEE_READ_TEE_USB_OTG_FS_PHY_M  (TEE_READ_TEE_USB_OTG_FS_PHY_V << TEE_READ_TEE_USB_OTG_FS_PHY_S)
#define TEE_READ_TEE_USB_OTG_FS_PHY_V  0x00000001U
#define TEE_READ_TEE_USB_OTG_FS_PHY_S  0
/** TEE_READ_REE0_USB_OTG_FS_PHY : R/W; bitpos: [1]; default: 0;
 *  Configures usb_otg_fs_phy registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_USB_OTG_FS_PHY    (BIT(1))
#define TEE_READ_REE0_USB_OTG_FS_PHY_M  (TEE_READ_REE0_USB_OTG_FS_PHY_V << TEE_READ_REE0_USB_OTG_FS_PHY_S)
#define TEE_READ_REE0_USB_OTG_FS_PHY_V  0x00000001U
#define TEE_READ_REE0_USB_OTG_FS_PHY_S  1
/** TEE_READ_REE1_USB_OTG_FS_PHY : R/W; bitpos: [2]; default: 0;
 *  Configures usb_otg_fs_phy registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_USB_OTG_FS_PHY    (BIT(2))
#define TEE_READ_REE1_USB_OTG_FS_PHY_M  (TEE_READ_REE1_USB_OTG_FS_PHY_V << TEE_READ_REE1_USB_OTG_FS_PHY_S)
#define TEE_READ_REE1_USB_OTG_FS_PHY_V  0x00000001U
#define TEE_READ_REE1_USB_OTG_FS_PHY_S  2
/** TEE_READ_REE2_USB_OTG_FS_PHY : R/W; bitpos: [3]; default: 0;
 *  Configures usb_otg_fs_phy registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_USB_OTG_FS_PHY    (BIT(3))
#define TEE_READ_REE2_USB_OTG_FS_PHY_M  (TEE_READ_REE2_USB_OTG_FS_PHY_V << TEE_READ_REE2_USB_OTG_FS_PHY_S)
#define TEE_READ_REE2_USB_OTG_FS_PHY_V  0x00000001U
#define TEE_READ_REE2_USB_OTG_FS_PHY_S  3
/** TEE_WRITE_TEE_USB_OTG_FS_PHY : R/W; bitpos: [4]; default: 1;
 *  Configures usb_otg_fs_phy registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_USB_OTG_FS_PHY    (BIT(4))
#define TEE_WRITE_TEE_USB_OTG_FS_PHY_M  (TEE_WRITE_TEE_USB_OTG_FS_PHY_V << TEE_WRITE_TEE_USB_OTG_FS_PHY_S)
#define TEE_WRITE_TEE_USB_OTG_FS_PHY_V  0x00000001U
#define TEE_WRITE_TEE_USB_OTG_FS_PHY_S  4
/** TEE_WRITE_REE0_USB_OTG_FS_PHY : R/W; bitpos: [5]; default: 0;
 *  Configures usb_otg_fs_phy registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_USB_OTG_FS_PHY    (BIT(5))
#define TEE_WRITE_REE0_USB_OTG_FS_PHY_M  (TEE_WRITE_REE0_USB_OTG_FS_PHY_V << TEE_WRITE_REE0_USB_OTG_FS_PHY_S)
#define TEE_WRITE_REE0_USB_OTG_FS_PHY_V  0x00000001U
#define TEE_WRITE_REE0_USB_OTG_FS_PHY_S  5
/** TEE_WRITE_REE1_USB_OTG_FS_PHY : R/W; bitpos: [6]; default: 0;
 *  Configures usb_otg_fs_phy registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_USB_OTG_FS_PHY    (BIT(6))
#define TEE_WRITE_REE1_USB_OTG_FS_PHY_M  (TEE_WRITE_REE1_USB_OTG_FS_PHY_V << TEE_WRITE_REE1_USB_OTG_FS_PHY_S)
#define TEE_WRITE_REE1_USB_OTG_FS_PHY_V  0x00000001U
#define TEE_WRITE_REE1_USB_OTG_FS_PHY_S  6
/** TEE_WRITE_REE2_USB_OTG_FS_PHY : R/W; bitpos: [7]; default: 0;
 *  Configures usb_otg_fs_phy registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_USB_OTG_FS_PHY    (BIT(7))
#define TEE_WRITE_REE2_USB_OTG_FS_PHY_M  (TEE_WRITE_REE2_USB_OTG_FS_PHY_V << TEE_WRITE_REE2_USB_OTG_FS_PHY_S)
#define TEE_WRITE_REE2_USB_OTG_FS_PHY_V  0x00000001U
#define TEE_WRITE_REE2_USB_OTG_FS_PHY_S  7

/** TEE_PVT_MONITOR_CTRL_REG register
 *  pvt_monitor read/write control register
 */
#define TEE_PVT_MONITOR_CTRL_REG (DR_REG_TEE_BASE + 0xf0)
/** TEE_READ_TEE_PVT_MONITOR : R/W; bitpos: [0]; default: 1;
 *  Configures pvt_monitor registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_PVT_MONITOR    (BIT(0))
#define TEE_READ_TEE_PVT_MONITOR_M  (TEE_READ_TEE_PVT_MONITOR_V << TEE_READ_TEE_PVT_MONITOR_S)
#define TEE_READ_TEE_PVT_MONITOR_V  0x00000001U
#define TEE_READ_TEE_PVT_MONITOR_S  0
/** TEE_READ_REE0_PVT_MONITOR : R/W; bitpos: [1]; default: 0;
 *  Configures pvt_monitor registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_PVT_MONITOR    (BIT(1))
#define TEE_READ_REE0_PVT_MONITOR_M  (TEE_READ_REE0_PVT_MONITOR_V << TEE_READ_REE0_PVT_MONITOR_S)
#define TEE_READ_REE0_PVT_MONITOR_V  0x00000001U
#define TEE_READ_REE0_PVT_MONITOR_S  1
/** TEE_READ_REE1_PVT_MONITOR : R/W; bitpos: [2]; default: 0;
 *  Configures pvt_monitor registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_PVT_MONITOR    (BIT(2))
#define TEE_READ_REE1_PVT_MONITOR_M  (TEE_READ_REE1_PVT_MONITOR_V << TEE_READ_REE1_PVT_MONITOR_S)
#define TEE_READ_REE1_PVT_MONITOR_V  0x00000001U
#define TEE_READ_REE1_PVT_MONITOR_S  2
/** TEE_READ_REE2_PVT_MONITOR : R/W; bitpos: [3]; default: 0;
 *  Configures pvt_monitor registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_PVT_MONITOR    (BIT(3))
#define TEE_READ_REE2_PVT_MONITOR_M  (TEE_READ_REE2_PVT_MONITOR_V << TEE_READ_REE2_PVT_MONITOR_S)
#define TEE_READ_REE2_PVT_MONITOR_V  0x00000001U
#define TEE_READ_REE2_PVT_MONITOR_S  3
/** TEE_WRITE_TEE_PVT_MONITOR : R/W; bitpos: [4]; default: 1;
 *  Configures pvt_monitor registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_PVT_MONITOR    (BIT(4))
#define TEE_WRITE_TEE_PVT_MONITOR_M  (TEE_WRITE_TEE_PVT_MONITOR_V << TEE_WRITE_TEE_PVT_MONITOR_S)
#define TEE_WRITE_TEE_PVT_MONITOR_V  0x00000001U
#define TEE_WRITE_TEE_PVT_MONITOR_S  4
/** TEE_WRITE_REE0_PVT_MONITOR : R/W; bitpos: [5]; default: 0;
 *  Configures pvt_monitor registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_PVT_MONITOR    (BIT(5))
#define TEE_WRITE_REE0_PVT_MONITOR_M  (TEE_WRITE_REE0_PVT_MONITOR_V << TEE_WRITE_REE0_PVT_MONITOR_S)
#define TEE_WRITE_REE0_PVT_MONITOR_V  0x00000001U
#define TEE_WRITE_REE0_PVT_MONITOR_S  5
/** TEE_WRITE_REE1_PVT_MONITOR : R/W; bitpos: [6]; default: 0;
 *  Configures pvt_monitor registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_PVT_MONITOR    (BIT(6))
#define TEE_WRITE_REE1_PVT_MONITOR_M  (TEE_WRITE_REE1_PVT_MONITOR_V << TEE_WRITE_REE1_PVT_MONITOR_S)
#define TEE_WRITE_REE1_PVT_MONITOR_V  0x00000001U
#define TEE_WRITE_REE1_PVT_MONITOR_S  6
/** TEE_WRITE_REE2_PVT_MONITOR : R/W; bitpos: [7]; default: 0;
 *  Configures pvt_monitor registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_PVT_MONITOR    (BIT(7))
#define TEE_WRITE_REE2_PVT_MONITOR_M  (TEE_WRITE_REE2_PVT_MONITOR_V << TEE_WRITE_REE2_PVT_MONITOR_S)
#define TEE_WRITE_REE2_PVT_MONITOR_V  0x00000001U
#define TEE_WRITE_REE2_PVT_MONITOR_S  7

/** TEE_PCNT_CTRL_REG register
 *  pcnt read/write control register
 */
#define TEE_PCNT_CTRL_REG (DR_REG_TEE_BASE + 0xf4)
/** TEE_READ_TEE_PCNT : R/W; bitpos: [0]; default: 1;
 *  Configures pcnt registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_PCNT    (BIT(0))
#define TEE_READ_TEE_PCNT_M  (TEE_READ_TEE_PCNT_V << TEE_READ_TEE_PCNT_S)
#define TEE_READ_TEE_PCNT_V  0x00000001U
#define TEE_READ_TEE_PCNT_S  0
/** TEE_READ_REE0_PCNT : R/W; bitpos: [1]; default: 0;
 *  Configures pcnt registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_PCNT    (BIT(1))
#define TEE_READ_REE0_PCNT_M  (TEE_READ_REE0_PCNT_V << TEE_READ_REE0_PCNT_S)
#define TEE_READ_REE0_PCNT_V  0x00000001U
#define TEE_READ_REE0_PCNT_S  1
/** TEE_READ_REE1_PCNT : R/W; bitpos: [2]; default: 0;
 *  Configures pcnt registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_PCNT    (BIT(2))
#define TEE_READ_REE1_PCNT_M  (TEE_READ_REE1_PCNT_V << TEE_READ_REE1_PCNT_S)
#define TEE_READ_REE1_PCNT_V  0x00000001U
#define TEE_READ_REE1_PCNT_S  2
/** TEE_READ_REE2_PCNT : R/W; bitpos: [3]; default: 0;
 *  Configures pcnt registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_PCNT    (BIT(3))
#define TEE_READ_REE2_PCNT_M  (TEE_READ_REE2_PCNT_V << TEE_READ_REE2_PCNT_S)
#define TEE_READ_REE2_PCNT_V  0x00000001U
#define TEE_READ_REE2_PCNT_S  3
/** TEE_WRITE_TEE_PCNT : R/W; bitpos: [4]; default: 1;
 *  Configures pcnt registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_PCNT    (BIT(4))
#define TEE_WRITE_TEE_PCNT_M  (TEE_WRITE_TEE_PCNT_V << TEE_WRITE_TEE_PCNT_S)
#define TEE_WRITE_TEE_PCNT_V  0x00000001U
#define TEE_WRITE_TEE_PCNT_S  4
/** TEE_WRITE_REE0_PCNT : R/W; bitpos: [5]; default: 0;
 *  Configures pcnt registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_PCNT    (BIT(5))
#define TEE_WRITE_REE0_PCNT_M  (TEE_WRITE_REE0_PCNT_V << TEE_WRITE_REE0_PCNT_S)
#define TEE_WRITE_REE0_PCNT_V  0x00000001U
#define TEE_WRITE_REE0_PCNT_S  5
/** TEE_WRITE_REE1_PCNT : R/W; bitpos: [6]; default: 0;
 *  Configures pcnt registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_PCNT    (BIT(6))
#define TEE_WRITE_REE1_PCNT_M  (TEE_WRITE_REE1_PCNT_V << TEE_WRITE_REE1_PCNT_S)
#define TEE_WRITE_REE1_PCNT_V  0x00000001U
#define TEE_WRITE_REE1_PCNT_S  6
/** TEE_WRITE_REE2_PCNT : R/W; bitpos: [7]; default: 0;
 *  Configures pcnt registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_PCNT    (BIT(7))
#define TEE_WRITE_REE2_PCNT_M  (TEE_WRITE_REE2_PCNT_V << TEE_WRITE_REE2_PCNT_S)
#define TEE_WRITE_REE2_PCNT_V  0x00000001U
#define TEE_WRITE_REE2_PCNT_S  7

/** TEE_IOMUX_CTRL_REG register
 *  iomux read/write control register
 */
#define TEE_IOMUX_CTRL_REG (DR_REG_TEE_BASE + 0xf8)
/** TEE_READ_TEE_IOMUX : R/W; bitpos: [0]; default: 1;
 *  Configures iomux registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_IOMUX    (BIT(0))
#define TEE_READ_TEE_IOMUX_M  (TEE_READ_TEE_IOMUX_V << TEE_READ_TEE_IOMUX_S)
#define TEE_READ_TEE_IOMUX_V  0x00000001U
#define TEE_READ_TEE_IOMUX_S  0
/** TEE_READ_REE0_IOMUX : R/W; bitpos: [1]; default: 0;
 *  Configures iomux registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_IOMUX    (BIT(1))
#define TEE_READ_REE0_IOMUX_M  (TEE_READ_REE0_IOMUX_V << TEE_READ_REE0_IOMUX_S)
#define TEE_READ_REE0_IOMUX_V  0x00000001U
#define TEE_READ_REE0_IOMUX_S  1
/** TEE_READ_REE1_IOMUX : R/W; bitpos: [2]; default: 0;
 *  Configures iomux registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_IOMUX    (BIT(2))
#define TEE_READ_REE1_IOMUX_M  (TEE_READ_REE1_IOMUX_V << TEE_READ_REE1_IOMUX_S)
#define TEE_READ_REE1_IOMUX_V  0x00000001U
#define TEE_READ_REE1_IOMUX_S  2
/** TEE_READ_REE2_IOMUX : R/W; bitpos: [3]; default: 0;
 *  Configures iomux registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_IOMUX    (BIT(3))
#define TEE_READ_REE2_IOMUX_M  (TEE_READ_REE2_IOMUX_V << TEE_READ_REE2_IOMUX_S)
#define TEE_READ_REE2_IOMUX_V  0x00000001U
#define TEE_READ_REE2_IOMUX_S  3
/** TEE_WRITE_TEE_IOMUX : R/W; bitpos: [4]; default: 1;
 *  Configures iomux registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_IOMUX    (BIT(4))
#define TEE_WRITE_TEE_IOMUX_M  (TEE_WRITE_TEE_IOMUX_V << TEE_WRITE_TEE_IOMUX_S)
#define TEE_WRITE_TEE_IOMUX_V  0x00000001U
#define TEE_WRITE_TEE_IOMUX_S  4
/** TEE_WRITE_REE0_IOMUX : R/W; bitpos: [5]; default: 0;
 *  Configures iomux registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_IOMUX    (BIT(5))
#define TEE_WRITE_REE0_IOMUX_M  (TEE_WRITE_REE0_IOMUX_V << TEE_WRITE_REE0_IOMUX_S)
#define TEE_WRITE_REE0_IOMUX_V  0x00000001U
#define TEE_WRITE_REE0_IOMUX_S  5
/** TEE_WRITE_REE1_IOMUX : R/W; bitpos: [6]; default: 0;
 *  Configures iomux registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_IOMUX    (BIT(6))
#define TEE_WRITE_REE1_IOMUX_M  (TEE_WRITE_REE1_IOMUX_V << TEE_WRITE_REE1_IOMUX_S)
#define TEE_WRITE_REE1_IOMUX_V  0x00000001U
#define TEE_WRITE_REE1_IOMUX_S  6
/** TEE_WRITE_REE2_IOMUX : R/W; bitpos: [7]; default: 0;
 *  Configures iomux registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_IOMUX    (BIT(7))
#define TEE_WRITE_REE2_IOMUX_M  (TEE_WRITE_REE2_IOMUX_V << TEE_WRITE_REE2_IOMUX_S)
#define TEE_WRITE_REE2_IOMUX_V  0x00000001U
#define TEE_WRITE_REE2_IOMUX_S  7

