espressif/esp-idf/components/soc/esp32h4/register/soc/tee_reg.h
/** TEE_INTPRI_REG_CTRL_REG register
 *  intpri_reg read/write control register
 */
#define TEE_INTPRI_REG_CTRL_REG (DR_REG_TEE_BASE + 0x134)
/** TEE_READ_TEE_INTPRI_REG : R/W; bitpos: [0]; default: 1;
 *  Configures intpri_reg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_INTPRI_REG    (BIT(0))
#define TEE_READ_TEE_INTPRI_REG_M  (TEE_READ_TEE_INTPRI_REG_V << TEE_READ_TEE_INTPRI_REG_S)
#define TEE_READ_TEE_INTPRI_REG_V  0x00000001U
#define TEE_READ_TEE_INTPRI_REG_S  0
/** TEE_READ_REE0_INTPRI_REG : R/W; bitpos: [1]; default: 0;
 *  Configures intpri_reg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_INTPRI_REG    (BIT(1))
#define TEE_READ_REE0_INTPRI_REG_M  (TEE_READ_REE0_INTPRI_REG_V << TEE_READ_REE0_INTPRI_REG_S)
#define TEE_READ_REE0_INTPRI_REG_V  0x00000001U
#define TEE_READ_REE0_INTPRI_REG_S  1
/** TEE_READ_REE1_INTPRI_REG : R/W; bitpos: [2]; default: 0;
 *  Configures intpri_reg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_INTPRI_REG    (BIT(2))
#define TEE_READ_REE1_INTPRI_REG_M  (TEE_READ_REE1_INTPRI_REG_V << TEE_READ_REE1_INTPRI_REG_S)
#define TEE_READ_REE1_INTPRI_REG_V  0x00000001U
#define TEE_READ_REE1_INTPRI_REG_S  2
/** TEE_READ_REE2_INTPRI_REG : R/W; bitpos: [3]; default: 0;
 *  Configures intpri_reg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_INTPRI_REG    (BIT(3))
#define TEE_READ_REE2_INTPRI_REG_M  (TEE_READ_REE2_INTPRI_REG_V << TEE_READ_REE2_INTPRI_REG_S)
#define TEE_READ_REE2_INTPRI_REG_V  0x00000001U
#define TEE_READ_REE2_INTPRI_REG_S  3
/** TEE_WRITE_TEE_INTPRI_REG : R/W; bitpos: [4]; default: 1;
 *  Configures intpri_reg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_INTPRI_REG    (BIT(4))
#define TEE_WRITE_TEE_INTPRI_REG_M  (TEE_WRITE_TEE_INTPRI_REG_V << TEE_WRITE_TEE_INTPRI_REG_S)
#define TEE_WRITE_TEE_INTPRI_REG_V  0x00000001U
#define TEE_WRITE_TEE_INTPRI_REG_S  4
/** TEE_WRITE_REE0_INTPRI_REG : R/W; bitpos: [5]; default: 0;
 *  Configures intpri_reg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_INTPRI_REG    (BIT(5))
#define TEE_WRITE_REE0_INTPRI_REG_M  (TEE_WRITE_REE0_INTPRI_REG_V << TEE_WRITE_REE0_INTPRI_REG_S)
#define TEE_WRITE_REE0_INTPRI_REG_V  0x00000001U
#define TEE_WRITE_REE0_INTPRI_REG_S  5
/** TEE_WRITE_REE1_INTPRI_REG : R/W; bitpos: [6]; default: 0;
 *  Configures intpri_reg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_INTPRI_REG    (BIT(6))
#define TEE_WRITE_REE1_INTPRI_REG_M  (TEE_WRITE_REE1_INTPRI_REG_V << TEE_WRITE_REE1_INTPRI_REG_S)
#define TEE_WRITE_REE1_INTPRI_REG_V  0x00000001U
#define TEE_WRITE_REE1_INTPRI_REG_S  6
/** TEE_WRITE_REE2_INTPRI_REG : R/W; bitpos: [7]; default: 0;
 *  Configures intpri_reg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_INTPRI_REG    (BIT(7))
#define TEE_WRITE_REE2_INTPRI_REG_M  (TEE_WRITE_REE2_INTPRI_REG_V << TEE_WRITE_REE2_INTPRI_REG_S)
#define TEE_WRITE_REE2_INTPRI_REG_V  0x00000001U
#define TEE_WRITE_REE2_INTPRI_REG_S  7

/** TEE_CACHE_CFG_CTRL_REG register
 *  cache_cfg read/write control register
 */
#define TEE_CACHE_CFG_CTRL_REG (DR_REG_TEE_BASE + 0x138)
/** TEE_READ_TEE_CACHE_CFG : R/W; bitpos: [0]; default: 1;
 *  Configures cache_cfg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_CACHE_CFG    (BIT(0))
#define TEE_READ_TEE_CACHE_CFG_M  (TEE_READ_TEE_CACHE_CFG_V << TEE_READ_TEE_CACHE_CFG_S)
#define TEE_READ_TEE_CACHE_CFG_V  0x00000001U
#define TEE_READ_TEE_CACHE_CFG_S  0
/** TEE_READ_REE0_CACHE_CFG : R/W; bitpos: [1]; default: 0;
 *  Configures cache_cfg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_CACHE_CFG    (BIT(1))
#define TEE_READ_REE0_CACHE_CFG_M  (TEE_READ_REE0_CACHE_CFG_V << TEE_READ_REE0_CACHE_CFG_S)
#define TEE_READ_REE0_CACHE_CFG_V  0x00000001U
#define TEE_READ_REE0_CACHE_CFG_S  1
/** TEE_READ_REE1_CACHE_CFG : R/W; bitpos: [2]; default: 0;
 *  Configures cache_cfg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_CACHE_CFG    (BIT(2))
#define TEE_READ_REE1_CACHE_CFG_M  (TEE_READ_REE1_CACHE_CFG_V << TEE_READ_REE1_CACHE_CFG_S)
#define TEE_READ_REE1_CACHE_CFG_V  0x00000001U
#define TEE_READ_REE1_CACHE_CFG_S  2
/** TEE_READ_REE2_CACHE_CFG : R/W; bitpos: [3]; default: 0;
 *  Configures cache_cfg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_CACHE_CFG    (BIT(3))
#define TEE_READ_REE2_CACHE_CFG_M  (TEE_READ_REE2_CACHE_CFG_V << TEE_READ_REE2_CACHE_CFG_S)
#define TEE_READ_REE2_CACHE_CFG_V  0x00000001U
#define TEE_READ_REE2_CACHE_CFG_S  3
/** TEE_WRITE_TEE_CACHE_CFG : R/W; bitpos: [4]; default: 1;
 *  Configures cache_cfg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_CACHE_CFG    (BIT(4))
#define TEE_WRITE_TEE_CACHE_CFG_M  (TEE_WRITE_TEE_CACHE_CFG_V << TEE_WRITE_TEE_CACHE_CFG_S)
#define TEE_WRITE_TEE_CACHE_CFG_V  0x00000001U
#define TEE_WRITE_TEE_CACHE_CFG_S  4
/** TEE_WRITE_REE0_CACHE_CFG : R/W; bitpos: [5]; default: 0;
 *  Configures cache_cfg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_CACHE_CFG    (BIT(5))
#define TEE_WRITE_REE0_CACHE_CFG_M  (TEE_WRITE_REE0_CACHE_CFG_V << TEE_WRITE_REE0_CACHE_CFG_S)
#define TEE_WRITE_REE0_CACHE_CFG_V  0x00000001U
#define TEE_WRITE_REE0_CACHE_CFG_S  5
/** TEE_WRITE_REE1_CACHE_CFG : R/W; bitpos: [6]; default: 0;
 *  Configures cache_cfg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_CACHE_CFG    (BIT(6))
#define TEE_WRITE_REE1_CACHE_CFG_M  (TEE_WRITE_REE1_CACHE_CFG_V << TEE_WRITE_REE1_CACHE_CFG_S)
#define TEE_WRITE_REE1_CACHE_CFG_V  0x00000001U
#define TEE_WRITE_REE1_CACHE_CFG_S  6
/** TEE_WRITE_REE2_CACHE_CFG : R/W; bitpos: [7]; default: 0;
 *  Configures cache_cfg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_CACHE_CFG    (BIT(7))
#define TEE_WRITE_REE2_CACHE_CFG_M  (TEE_WRITE_REE2_CACHE_CFG_V << TEE_WRITE_REE2_CACHE_CFG_S)
#define TEE_WRITE_REE2_CACHE_CFG_V  0x00000001U
#define TEE_WRITE_REE2_CACHE_CFG_S  7

/** TEE_MODEM_CTRL_REG register
 *  modem read/write control register
 */
#define TEE_MODEM_CTRL_REG (DR_REG_TEE_BASE + 0x13c)
/** TEE_READ_TEE_MODEM : R/W; bitpos: [0]; default: 1;
 *  Configures modem registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_MODEM    (BIT(0))
#define TEE_READ_TEE_MODEM_M  (TEE_READ_TEE_MODEM_V << TEE_READ_TEE_MODEM_S)
#define TEE_READ_TEE_MODEM_V  0x00000001U
#define TEE_READ_TEE_MODEM_S  0
/** TEE_READ_REE0_MODEM : R/W; bitpos: [1]; default: 0;
 *  Configures modem registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_MODEM    (BIT(1))
#define TEE_READ_REE0_MODEM_M  (TEE_READ_REE0_MODEM_V << TEE_READ_REE0_MODEM_S)
#define TEE_READ_REE0_MODEM_V  0x00000001U
#define TEE_READ_REE0_MODEM_S  1
/** TEE_READ_REE1_MODEM : R/W; bitpos: [2]; default: 0;
 *  Configures modem registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_MODEM    (BIT(2))
#define TEE_READ_REE1_MODEM_M  (TEE_READ_REE1_MODEM_V << TEE_READ_REE1_MODEM_S)
#define TEE_READ_REE1_MODEM_V  0x00000001U
#define TEE_READ_REE1_MODEM_S  2
/** TEE_READ_REE2_MODEM : R/W; bitpos: [3]; default: 0;
 *  Configures modem registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_MODEM    (BIT(3))
#define TEE_READ_REE2_MODEM_M  (TEE_READ_REE2_MODEM_V << TEE_READ_REE2_MODEM_S)
#define TEE_READ_REE2_MODEM_V  0x00000001U
#define TEE_READ_REE2_MODEM_S  3
/** TEE_WRITE_TEE_MODEM : R/W; bitpos: [4]; default: 1;
 *  Configures modem registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_MODEM    (BIT(4))
#define TEE_WRITE_TEE_MODEM_M  (TEE_WRITE_TEE_MODEM_V << TEE_WRITE_TEE_MODEM_S)
#define TEE_WRITE_TEE_MODEM_V  0x00000001U
#define TEE_WRITE_TEE_MODEM_S  4
/** TEE_WRITE_REE0_MODEM : R/W; bitpos: [5]; default: 0;
 *  Configures modem registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_MODEM    (BIT(5))
#define TEE_WRITE_REE0_MODEM_M  (TEE_WRITE_REE0_MODEM_V << TEE_WRITE_REE0_MODEM_S)
#define TEE_WRITE_REE0_MODEM_V  0x00000001U
#define TEE_WRITE_REE0_MODEM_S  5
/** TEE_WRITE_REE1_MODEM : R/W; bitpos: [6]; default: 0;
 *  Configures modem registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_MODEM    (BIT(6))
#define TEE_WRITE_REE1_MODEM_M  (TEE_WRITE_REE1_MODEM_V << TEE_WRITE_REE1_MODEM_S)
#define TEE_WRITE_REE1_MODEM_V  0x00000001U
#define TEE_WRITE_REE1_MODEM_S  6
/** TEE_WRITE_REE2_MODEM : R/W; bitpos: [7]; default: 0;
 *  Configures modem registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_MODEM    (BIT(7))
#define TEE_WRITE_REE2_MODEM_M  (TEE_WRITE_REE2_MODEM_V << TEE_WRITE_REE2_MODEM_S)
#define TEE_WRITE_REE2_MODEM_V  0x00000001U
#define TEE_WRITE_REE2_MODEM_S  7

