espressif/esp-idf/components/soc/esp32h4/register/soc/tee_reg.h
/** TEE_ZERO_DET_CTRL_REG register
 *  zero_det read/write control register
 */
#define TEE_ZERO_DET_CTRL_REG (DR_REG_TEE_BASE + 0x140)
/** TEE_READ_TEE_ZERO_DET : R/W; bitpos: [0]; default: 1;
 *  Configures zero_det registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_ZERO_DET    (BIT(0))
#define TEE_READ_TEE_ZERO_DET_M  (TEE_READ_TEE_ZERO_DET_V << TEE_READ_TEE_ZERO_DET_S)
#define TEE_READ_TEE_ZERO_DET_V  0x00000001U
#define TEE_READ_TEE_ZERO_DET_S  0
/** TEE_READ_REE0_ZERO_DET : R/W; bitpos: [1]; default: 0;
 *  Configures zero_det registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_ZERO_DET    (BIT(1))
#define TEE_READ_REE0_ZERO_DET_M  (TEE_READ_REE0_ZERO_DET_V << TEE_READ_REE0_ZERO_DET_S)
#define TEE_READ_REE0_ZERO_DET_V  0x00000001U
#define TEE_READ_REE0_ZERO_DET_S  1
/** TEE_READ_REE1_ZERO_DET : R/W; bitpos: [2]; default: 0;
 *  Configures zero_det registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_ZERO_DET    (BIT(2))
#define TEE_READ_REE1_ZERO_DET_M  (TEE_READ_REE1_ZERO_DET_V << TEE_READ_REE1_ZERO_DET_S)
#define TEE_READ_REE1_ZERO_DET_V  0x00000001U
#define TEE_READ_REE1_ZERO_DET_S  2
/** TEE_READ_REE2_ZERO_DET : R/W; bitpos: [3]; default: 0;
 *  Configures zero_det registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_ZERO_DET    (BIT(3))
#define TEE_READ_REE2_ZERO_DET_M  (TEE_READ_REE2_ZERO_DET_V << TEE_READ_REE2_ZERO_DET_S)
#define TEE_READ_REE2_ZERO_DET_V  0x00000001U
#define TEE_READ_REE2_ZERO_DET_S  3
/** TEE_WRITE_TEE_ZERO_DET : R/W; bitpos: [4]; default: 1;
 *  Configures zero_det registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_ZERO_DET    (BIT(4))
#define TEE_WRITE_TEE_ZERO_DET_M  (TEE_WRITE_TEE_ZERO_DET_V << TEE_WRITE_TEE_ZERO_DET_S)
#define TEE_WRITE_TEE_ZERO_DET_V  0x00000001U
#define TEE_WRITE_TEE_ZERO_DET_S  4
/** TEE_WRITE_REE0_ZERO_DET : R/W; bitpos: [5]; default: 0;
 *  Configures zero_det registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_ZERO_DET    (BIT(5))
#define TEE_WRITE_REE0_ZERO_DET_M  (TEE_WRITE_REE0_ZERO_DET_V << TEE_WRITE_REE0_ZERO_DET_S)
#define TEE_WRITE_REE0_ZERO_DET_V  0x00000001U
#define TEE_WRITE_REE0_ZERO_DET_S  5
/** TEE_WRITE_REE1_ZERO_DET : R/W; bitpos: [6]; default: 0;
 *  Configures zero_det registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_ZERO_DET    (BIT(6))
#define TEE_WRITE_REE1_ZERO_DET_M  (TEE_WRITE_REE1_ZERO_DET_V << TEE_WRITE_REE1_ZERO_DET_S)
#define TEE_WRITE_REE1_ZERO_DET_V  0x00000001U
#define TEE_WRITE_REE1_ZERO_DET_S  6
/** TEE_WRITE_REE2_ZERO_DET : R/W; bitpos: [7]; default: 0;
 *  Configures zero_det registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_ZERO_DET    (BIT(7))
#define TEE_WRITE_REE2_ZERO_DET_M  (TEE_WRITE_REE2_ZERO_DET_V << TEE_WRITE_REE2_ZERO_DET_S)
#define TEE_WRITE_REE2_ZERO_DET_V  0x00000001U
#define TEE_WRITE_REE2_ZERO_DET_S  7

/** TEE_BUS_ERR_CONF_REG register
 *  Clock gating register
 */
#define TEE_BUS_ERR_CONF_REG (DR_REG_TEE_BASE + 0xff0)
/** TEE_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether return error response to cpu when access blocked
 *  0: disable error response
 *  1: enable error response
 */
#define TEE_BUS_ERR_RESP_EN    (BIT(0))
#define TEE_BUS_ERR_RESP_EN_M  (TEE_BUS_ERR_RESP_EN_V << TEE_BUS_ERR_RESP_EN_S)
#define TEE_BUS_ERR_RESP_EN_V  0x00000001U
#define TEE_BUS_ERR_RESP_EN_S  0

/** TEE_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define TEE_CLOCK_GATE_REG (DR_REG_TEE_BASE + 0xff8)
/** TEE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define TEE_CLK_EN    (BIT(0))
#define TEE_CLK_EN_M  (TEE_CLK_EN_V << TEE_CLK_EN_S)
#define TEE_CLK_EN_V  0x00000001U
#define TEE_CLK_EN_S  0

/** TEE_DATE_REG register
 *  Version control register
 */
#define TEE_DATE_REG (DR_REG_TEE_BASE + 0xffc)
/** TEE_DATE : R/W; bitpos: [27:0]; default: 38810240;
 *  Version control register
 */
#define TEE_DATE    0x0FFFFFFFU
#define TEE_DATE_M  (TEE_DATE_V << TEE_DATE_S)
#define TEE_DATE_V  0x0FFFFFFFU
#define TEE_DATE_S  0

#ifdef __cplusplus
}
#endif
